Tekla Open API Reference for Tekla Structures 2025
ShapeItem.Delete Method
 Deletes a shape from shape catalog based on the shape name.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Delete()
Public Function Delete As Boolean
Return Value
Type: Boolean
 true on success.
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace